Autodesk.Revit.DB.GeometryElement.GetTransformed(Autodesk.Revit.DB.Transform)
Returns a transformed copy of the geometry in this element.
transform: The transformation to apply to the geometry.
Throws Autodesk.Revit.Exceptions.ArgumentException: Transform is not conformal

Autodesk.Revit.DB.GeometryElement.MaterialElement
Element describing the material from which this element is composed.

Autodesk.Revit.DB.GeometryElement.AddForTransientDisplay(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,System.Collections.Generic.IList{Autodesk.Revit.DB.GeometryObject},Autodesk.Revit.DB.ElementId)
Adds collection of GeometryObjects to the transient (temporary) element for application display which will not be saved with the model.
Returns: Resulting GeometryElement after adding collection
Since:  2015

Autodesk.Revit.DB.GeometryElement.SetForTransientDisplay(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,System.Collections.Generic.IList{Autodesk.Revit.DB.GeometryObject},Autodesk.Revit.DB.ElementId)
Creates or set geometry of transient (temporary) element for application display which will not be saved with the model.
Returns: The element id of the created element.
Since:  2015

Autodesk.Revit.DB.GeometryElement.GetEnumeratorNG
Returns an enumerator that iterates through the collection.
Returns: An IEnumerator(GeometryObject) object that can be used to iterate through the collection.

Autodesk.Revit.DB.GeometryElement.GetBoundingBox
Retrieves a box that encloses the geometry element.
Returns: The bounding box.
Since:  2013

Autodesk.Revit.DB.GeometryElement.GetEnumerator
Returns an enumerator that iterates through the collection.
Returns: An IEnumerator(GeometryObject) object that can be used to iterate through the collection.

Autodesk.Revit.DB.GeometryElement
Geometric representation of an element.
Remarks: This class contains geometric primitives that are generated from the
parametric description of the element. The member geometric primitives can be obtained
directly from this object using the capabilities of IEnumerable.